docs/tracking/2026-03-07_NARROWING_ABSTRACT_INTERPRETATION_DESIGN.org
** 1.2 Architecture: Galois Connections as Cross-Domain Propagators

The key insight: Prologos already implements Galois connections as
cross-domain propagators (=net-add-cross-domain-propagator= in
=propagator.rkt=). The existing pattern:

#+begin_example
net-add-cross-domain-propagator(net, concrete-cell, abstract-cell, alpha, gamma)
  creates two propagators:
    alpha: concrete-cell -> abstract-cell   (abstraction)
    gamma: abstract-cell -> concrete-cell   (concretization)
#+end_example

This is used today for the Type $\leftrightarrow$ Multiplicity bridge
(=elaborator-network.rkt= line 894). For abstract interpretation in
narrowing, we use the same pattern:

#+begin_example
Term Cell (concrete)  <--alpha/gamma-->  Interval Cell (abstract)

alpha: Ctor(Suc, [Ctor(Suc, [Ctor(Zero)])]) --> [2, 2]
gamma: [3, 7] --> {Ctor(Suc^n, [Ctor(Zero)]) | 3 <= n <= 7}

Cross-domain propagation:
  When the interval cell narrows [0, 100] to [3, 7]:
    gamma fires, writes constrained constructor set to term cell
  When the term cell learns Ctor(Suc, _):
    alpha fires, writes [1, infinity) to interval cell (at least 1)
#+end_example

The Galois connection requirements ($\alpha \circ \gamma \geq id$ and
$\gamma \circ \alpha \leq id$) ensure soundness: no valid solutions are
lost, and abstract information correctly constrains concrete narrowing.

** 1.3 Phase 2a: Interval Abstract Domain

*** 1.3.1 Design

A new module =interval-domain.rkt= implementing:

#+begin_src racket
;; Interval bounds (extended integers)
;; -inf, +inf for unbounded; concrete integers for bounded
(struct interval (lo hi) #:transparent)

;; Lattice operations
interval-bot       ;; = entire type domain (no constraint)
interval-top       ;; = empty (contradiction)
interval-merge     ;; intersection: [max(lo1,lo2), min(hi1,hi2)]
interval-contradicts?  ;; lo > hi

;; Arithmetic operations (interval arithmetic)
interval-add       ;; [a,b] + [c,d] = [a+c, b+d]
interval-sub       ;; [a,b] - [c,d] = [a-d, b-c]
interval-mul       ;; [a,b] * [c,d] = [min(ac,ad,bc,bd), max(ac,ad,bc,bd)]
interval-negate    ;; -[a,b] = [-b,-a]

;; Domain operations
interval-split     ;; [a,b] -> ([a,mid], [mid+1,b]) for search branching
interval-singleton? ;; lo = hi (determined)
interval-size      ;; hi - lo + 1 (for first-fail heuristic)
interval-contains? ;; value in [lo, hi]

;; Constraint propagators (installed as propagator functions)
interval-eq-propagator   ;; X = Y: intersect domains
interval-neq-propagator  ;; X /= Y: if one is singleton, remove from other
interval-leq-propagator  ;; X <= Y: X.hi := min(X.hi, Y.hi), Y.lo := max(Y.lo, X.lo)
interval-add-propagator  ;; X + Y = Z: narrow all three using interval arithmetic
interval-mul-propagator  ;; X * Y = Z: narrow all three
#+end_src

*** 1.3.2 Galois Connection: Term Cells $\leftrightarrow$ Interval Cells

For numeric types (=Nat=, =Int=, =PosInt=, =Rat=):

#+begin_src racket
;; Alpha: Term -> Interval
;; Given a term cell value, compute the interval it represents
(define (term->interval-alpha term-val type-info)
  (match term-val
    ['bot  (type-initial-interval type-info)]  ;; full domain from type
    [(term-var _) (type-initial-interval type-info)]
    [(term-ctor 'Zero '()) (interval 0 0)]
    [(term-ctor 'Suc (list sub))
     (let ([sub-int (term->interval-alpha sub type-info)])
       (interval-add sub-int (interval 1 1)))]
    ;; Literal integers
    [(? integer? n) (interval n n)]
    ;; Unknown constructor — full domain
    [_ (type-initial-interval type-info)]))

;; Gamma: Interval -> Term constraint
;; Given an interval, constrain what constructors are valid
(define (interval->term-gamma int-val type-info)
  (cond
    [(interval-singleton? int-val)
     ;; Exactly one value — construct the concrete term
     (integer->nat-term (interval-lo int-val))]
    [(interval-contradicts? int-val)
     'top]  ;; contradiction
    [else
     ;; Range — can't determine exact constructor, but can
     ;; constrain: if [3, 7], then at least Suc(Suc(Suc(_)))
     ;; This partial information narrows the term cell
     (interval-to-partial-term int-val type-info)]))

;; Type-specific initial intervals
(define (type-initial-interval type-info)
  (match (type-info-name type-info)
    ['Nat    (interval 0 +inf.0)]
    ['PosInt (interval 1 +inf.0)]
    ['Int    (interval -inf.0 +inf.0)]
    ['Rat    (interval -inf.0 +inf.0)]
    [_ (error "no interval domain for type")]))
#+end_src

*** 1.3.3 Integration with Narrowing Propagator

When a narrowing propagator encounters a branch on a numeric type:

1. Instead of creating an =amb= over infinitely many constructors,
   create an /interval cell/ for the variable via the Galois connection.
2. Install interval constraint propagators based on the function body.
3. Run propagation to narrow the interval.
4. At the branching phase:
   - If the interval is a singleton: bind the variable directly (no search).
   - If the interval is finite and small ($|D| \leq$ threshold): create
     =amb= over the concrete values.
   - If the interval is large: use =interval-split= (binary search) via
     =amb= with two alternatives: $[lo, mid]$ and $[mid+1, hi]$.
   - If the interval is infinite: widen to force convergence, then narrow.

#+begin_example
narrowing-add(?x, ?y, 13):
  1. Create interval cells: ix = [0, +inf), iy = [0, +inf)
  2. Install: interval-add-propagator(ix, iy, iz=[13,13])
  3. Propagation narrows: ix = [0, 13], iy = [0, 13]
  4. Branching: split ix → [0, 6] | [7, 13]
     Each branch propagates further...
  5. Eventually: 14 solutions found, each with ix=[k,k], iy=[13-k,13-k]
#+end_example

*** 1.3.4 Implementation

| Component | File | Lines (est.) | Tests (est.) |
|-|-|-|-|
| Interval struct + lattice ops | =interval-domain.rkt= | 120 | 25 |
| Interval arithmetic | =interval-domain.rkt= | 80 | 20 |
| Interval constraint propagators | =interval-domain.rkt= | 100 | 20 |
| Galois connection (term $\leftrightarrow$ interval) | =narrowing-abstract.rkt= | 150 | 25 |
| Narrowing propagator integration | =narrowing.rkt= (modify) | 80 | 15 |
| *Sub-total Phase 2a* | *2 new + 1 modified* | *~530* | *~105* |

*** 1.3.5 Tests

- Interval lattice properties: idempotent, commutative, associative merge
- Interval arithmetic: add, sub, mul correctness with boundary cases
- Galois connection soundness: $\alpha(\gamma(x)) \geq x$ and
  $\gamma(\alpha(t)) \leq t$
- =[add ?x ?y] = 13N= with interval narrowing → 14 solutions
- =[mul ?x ?y] = 12N= with interval narrowing → 6 solutions (1*12, 2*6, etc.)
- PosInt domain: =[add ?x ?y] = 5N= with =spec ... : PosInt -> PosInt -> PosInt=
  → only 4 solutions (1+4, 2+3, 3+2, 4+1)
- Interval splitting for large domains
- Singleton detection and direct binding

** 1.4 Phase 2b: Size-Based Termination Analysis

*** 1.4.1 The Problem

Recursive narrowing may not terminate. Consider:

#+begin_src prologos
defn f [x] := [f [Suc x]]    ;; diverges on any input
#+end_src

Narrowing =[f ?x] = 5N= would recurse infinitely. We need to /statically/
detect potential non-termination and either:
(a) reject the function as non-narrowable, or
(b) insert fuel bounds, or
(c) use widening to force convergence.

