docs/tracking/2026-03-07_NARROWING_ABSTRACT_INTERPRETATION_DESIGN.md


<a id="org4fe497d"></a>

### 1.4.2 Size-Based Abstract Domain

Following Chin & Khoo (2001) and Lee, Jones & Ben-Amram (2001), we define a *size-based abstract domain* that tracks how argument sizes change across recursive calls:

```racket
;; Size abstraction
(struct size-info (dimension change) #:transparent)
;; dimension: which argument
;; change: 'decreasing | 'non-increasing | 'increasing | 'unknown

;; Size order: a partial order on size-info
;; decreasing < non-increasing < unknown
;; increasing is incomparable with decreasing

;; Size matrix for a function: rows = recursive calls, cols = arguments
;; M[i,j] = how argument j changes in recursive call i
;; Example for add:
;;   add(Suc(n), y) → add(n, y)
;;   M = [[decreasing, non-increasing]]
;;   Column 1 strictly decreases → termination guaranteed
```


<a id="orgfe92f9e"></a>

### 1.4.3 Analysis Algorithm

```
analyze-termination(def-tree, clauses):
  1. For each recursive call in each clause:
     a. Compare actual args with formal params
     b. Determine size change per argument:
        - Ctor(tag, [x]) where x is a subterm of param → 'decreasing
        - Same variable as param → 'non-increasing
        - Ctor wrapping param → 'increasing
        - Otherwise → 'unknown
  2. Build the size-change matrix M
  3. Check the Lee-Jones-Ben-Amram (LJBA) criterion:
     For every idempotent matrix in the transitive closure of M,
     at least one diagonal entry must be 'decreasing
  4. Verdict:
     - LJBA satisfied → definitely terminates (safe for unrestricted narrowing)
     - Not satisfied → potentially non-terminating:
       a. If some column is non-increasing: use fuel (bounded narrowing)
       b. If all columns are unknown: reject as non-narrowable
```


<a id="orgfae1f81"></a>

### 1.4.4 Integration with Narrowing

The termination analysis is a *compile-time* static analysis, run once per `defn` during elaboration (alongside definitional tree extraction):

```racket
;; Stored in function metadata alongside the definitional tree
(struct narrowing-info
  (def-tree           ;; definitional tree (from Phase 1a)
   termination-class  ;; 'terminating | 'bounded | 'non-narrowable
   size-matrix        ;; the size-change matrix
   fuel-bound)        ;; #f or Nat (estimated bound for 'bounded class)
  #:transparent)
```

When the narrowing propagator encounters a recursive call:

-   `terminating`: proceed normally (guaranteed to finish).
-   `bounded`: decrement fuel counter; fail (contradiction) if fuel exhausted.
-   `non-narrowable`: residuate (don't narrow; wait for the variable to be bound by another constraint). Emit a warning/note if the user explicitly requested narrowing.


<a id="org86e7ed8"></a>

### 1.4.4a Domain-Bounded Fuel Estimation (2a + 2b Interaction)

When Phase 2a's interval domain is available, `bounded` functions can compute *dynamic* fuel bounds from the concrete domain size rather than using a fixed default. If a function's argument has interval domain $[a, b]$ with finite $b - a$, and the size-change matrix shows non-increasing recursion on that argument, then the maximum recursion depth is bounded by $b - a + 1$.

```
defn f [x] := [f [sub x 1N]]   ;; size-change: non-increasing (not structurally decreasing)
                                ;; classified as 'bounded

;; Without interval domain: fuel = fixed default (e.g., 1000)
;; With interval domain ?x ∈ [3, 7]: fuel = 7 - 3 + 1 = 5
```

This is computed at narrowing time (not elaboration time) since the interval domain is only known after constraint propagation narrows it. The narrowing propagator checks: if the function is `bounded` AND the relevant argument has a finite interval domain, compute fuel from the domain size. Otherwise, fall back to the default fuel bound.


<a id="org125deac"></a>

### 1.4.5 Widening for Non-Terminating Abstract Fixpoints

When interval constraint propagation itself involves recursion (e.g., propagators that reference each other cyclically), the abstract fixpoint may not converge. Widening forces convergence:

```
Widening for intervals:
  widen([a1, b1], [a2, b2]) =
    [if a2 < a1 then -inf else a1,
     if b2 > b1 then +inf else b1]
```

Prologos already has the widening infrastructure:

-   `net-set-widen-point` marks a cell for widening.
-   `run-to-quiescence-widen` implements the two-phase widen→narrow iteration.

For narrowing, we mark interval cells at recursive narrowing positions as widening points. The existing `run-to-quiescence-widen` handles the rest: Phase 1 (widen) over-approximates for convergence, Phase 2 (narrow) recovers precision.


<a id="orgb497377"></a>

### 1.4.6 Implementation

| Component                       | File                       | Lines (est.) | Tests (est.) |
|------------------------------- |-------------------------- |------------ |------------ |
| Size-change analysis            | `termination-analysis.rkt` | 200          | 35           |
| LJBA criterion check            | `termination-analysis.rkt` | 100          | 20           |
| Integration with narrowing-info | `narrowing.rkt` (modify)   | 40           | 10           |
| Fuel bounds for bounded class   | `narrowing.rkt` (modify)   | 30           | 10           |
| Warning/note for non-narrowable | `narrowing.rkt` (modify)   | 20           | 5            |
| **Sub-total Phase 2b**          | **1 new + 1 modified**     | **~390**     | **~80**      |


<a id="orgfeec2d4"></a>

### 1.4.7 Tests

-   Size matrix extraction for `add`, `append`, `map`, `fib`, `ack`
-   `add`: column 1 decreasing → `terminating`
-   `append`: column 1 decreasing → `terminating`
-   `fib`: both calls decrease arg 1 → `terminating`
-   `ack`: lexicographic decrease → `terminating` (LJBA handles this)
-   `loop x :` loop x=: no decreasing column → `non-narrowable`
-   `f x :` f (Suc x)=: column 1 increasing → `non-narrowable`
-   `collatz`: column 1 unknown → `bounded` with fuel
-   Integration: narrowing with fuel bounds respects limit
-   Integration: non-narrowable function residuates, emits warning


<a id="orge5fc4b8"></a>

## 1.5 Phase 2c: Critical Pair Analysis for Confluence


<a id="org2d23638"></a>

### 1.5.1 The Problem: Church-Rosser Property

Narrowing's completeness relies on the term rewriting system being *confluent* (Church-Rosser): if a term can be rewritten in two different ways, both paths must converge to a common reduct. For inductively sequential functions (Phase 1), confluence holds automatically (the definitional tree ensures non-overlapping rules). But for non-deterministic functions (Or-branches, D7 in Phase 1 design), confluence may fail.

Confluence matters because:

-   If non-confluent, narrowing may miss solutions (incompleteness).
-   If non-confluent, narrowing may find spurious solutions (unsoundness for some strategies).


<a id="org88408eb"></a>

### 1.5.2 Critical Pair Analysis

Two rules $l_1 \to r_1$ and $l_2 \to r_2$ form a *critical pair* if their left-hand sides overlap (unify at some position). The critical pair is: $(r_1\sigma, r_2\sigma)$ where $\sigma = mgu(l_1|_p, l_2)$ for some position $p$ in $l_1$.

A TRS is confluent if and only if all critical pairs are *joinable*: both elements can be rewritten to a common term (Knuth-Bendix, 1970).
