docs/tracking/2026-03-07_NARROWING_ABSTRACT_INTERPRETATION_DESIGN.org
*** 1.5.3 Analysis Algorithm

The analysis is /lazy/: inductively sequential functions (those whose
definitional tree has no Or-branches) are confluent by construction and
skip critical pair analysis entirely. Only functions with Or-branches
(non-deterministic, overlapping rules) trigger the full analysis.

#+begin_example
check-confluence(def-tree, clauses):
  0. FAST PATH: If def-tree has no Or-branches → 'confluent (skip analysis)
     This covers the common case (add, append, map, filter, etc.) at O(tree-size)
  1. SLOW PATH (Or-branches present):
     For each pair of clauses (c1, c2) (including c1 with itself):
     a. Rename variables to be disjoint
     b. For each non-variable position p in lhs(c1):
        Try to unify lhs(c1)|_p with lhs(c2)
     c. If unifiable with mgu sigma:
        Compute critical pair (rhs(c1)*sigma, rhs(c2)*sigma)
        Try to join: reduce both sides and check convergence
  2. Classification:
     - All critical pairs joinable → confluent (optimal narrowing applies)
     - Some non-joinable → non-confluent:
       a. Warn the user
       b. Use more conservative (complete but less optimal) narrowing strategy
       c. Or: require the user to add rules to resolve the overlap
#+end_example

*** 1.5.4 Integration

Confluence analysis is another /compile-time/ static analysis stored in
=narrowing-info=:

#+begin_src racket
(struct narrowing-info
  (def-tree
   termination-class
   size-matrix
   fuel-bound
   confluence-class     ;; 'confluent | 'non-confluent | 'unknown
   critical-pairs)      ;; list of critical-pair structs (for diagnostics)
  #:transparent)
#+end_src

The narrowing propagator checks =confluence-class=:
- =confluent=: use optimal needed narrowing (Phase 1 strategy).
- =non-confluent=: use /basic narrowing/ (explore all overlaps), which is
  complete but not optimal. Emit a compiler note suggesting the user
  either make the function inductively sequential or add resolving rules.
- =unknown=: joinability is undecidable in general; treat as potentially
  non-confluent.

*** 1.5.5 Implementation

| Component | File | Lines (est.) | Tests (est.) |
|-|-|-|-|
| Critical pair computation | =confluence-analysis.rkt= | 180 | 30 |
| Joinability checking (reduction) | =confluence-analysis.rkt= | 120 | 20 |
| Integration with narrowing-info | =narrowing.rkt= (modify) | 30 | 10 |
| Compiler notes for non-confluence | =narrowing.rkt= (modify) | 20 | 5 |
| *Sub-total Phase 2c* | *1 new + 1 modified* | *~350* | *~65* |

*** 1.5.6 Tests

- Inductively sequential functions (=add=, =append=): no critical pairs → confluent
- Non-deterministic =insert=: critical pair exists but joinable → confluent
- Deliberately non-confluent function: critical pair detected → =non-confluent=
- Self-overlap detection (a rule overlapping with itself)
- Nested overlap detection
- Compiler note emission for non-confluent functions

** 1.6 Phase 2 Summary

| Sub-phase                      | Module                                          | Lines (est.) | Tests (est.) |
|--------------------------------+-------------------------------------------------+--------------+--------------|
| 2a: Interval Abstract Domain   | =interval-domain.rkt=, =narrowing-abstract.rkt= |          530 |          105 |
| 2b: Size-Based Termination     | =termination-analysis.rkt=                      |          390 |           80 |
| 2c: Critical Pair / Confluence | =confluence-analysis.rkt=                       |          350 |           65 |
| *Phase 2 Total*                | *4 new + 1 modified*                            |     *~1,270* |       *~250* |

** 1.7 Phase 2 Dependencies and Ordering

#+begin_example
Phase 1 (complete)
  |
  +-- Phase 2a (Interval Domain)
  |     |
  |     +-- Narrowing propagator integration (reads interval cells)
  |
  +-- Phase 2b (Termination Analysis)  [independent of 2a]
  |     |
  |     +-- narrowing-info extended with termination-class
  |
  +-- Phase 2c (Confluence Analysis)   [independent of 2a, 2b]
        |
        +-- narrowing-info extended with confluence-class
#+end_example

Phases 2a, 2b, and 2c are mutually independent and can be implemented in
any order. All three modify =narrowing.rkt= to integrate their results
into the narrowing propagator.

* 2. Phase 3: Advanced Extensions

** 2.1 Phase 3a: 0-CFA Closure Analysis for Auto-Defunctionalization

*** 2.1.1 The Problem: Higher-Order Narrowing

Phase 1 (D10) specifies: when a higher-order function argument is /known/
(a specific =defn=), narrow through the application. When /unknown/,
residuate.

But often a higher-order argument isn't statically known at the narrowing
call site yet could be determined by analysis. Consider:

#+begin_src prologos
defn apply-op [f x y]
  | [f x y] := [f x y]

;; Usage:
[apply-op add 3N ?y] = 10N     ;; f = add, known at this call site
[apply-op ?f 3N 7N] = 10N      ;; f is unknown — which functions could it be?
#+end_src

For the second query, we need to determine the set of functions that could
flow to =?f=. This is exactly what 0-CFA (zeroth-order Control Flow
Analysis) computes.

*** 2.1.2 0-CFA Overview

0-CFA (Shivers 1991) is an abstract interpretation that computes, for each
expression in the program, the set of /closures/ (lambda abstractions or
named functions) that could be its value at runtime.

For Prologos, 0-CFA would compute:

#+begin_example
0-CFA Analysis:
  For each variable/expression of function type:
    Compute the set of defn names that could flow to it

  If the set is finite: the HO argument can be defunctionalized
    → create an amb over the functions in the set
    → for each function, install narrowing propagators
  If the set is infinite/unknown: residuate (don't narrow)
#+end_example

*** 2.1.3 Connection to Defunctionalization

Reynolds (1972) showed that any higher-order program can be transformed
to first-order by /defunctionalization/:

1. Each lambda/function becomes a constructor of a function-type ADT.
2. An =apply= function pattern-matches on the constructor to dispatch.

0-CFA determines the set of functions at each call site, which is exactly
the constructor universe for the defunctionalized ADT. This connects
narrowing to defunctionalization:

#+begin_example
If 0-CFA determines f ∈ {add, mul, sub} at a call site:

Defunctionalized:
  type Op := Add | Mul | Sub
  defn apply-op [op x y]
    | [Add x y] := [add x y]
    | [Mul x y] := [mul x y]
    | [Sub x y] := [sub x y]

Narrowing: amb over {Add, Mul, Sub}
  → try narrowing each function separately
#+end_example

