docs/tracking/2026-03-07_NARROWING_ABSTRACT_INTERPRETATION_DESIGN.org
*** 2.1.4 Implementation

The 0-CFA analysis is a /whole-program/ static analysis, run at module
boundary (or lazily on demand for narrowing):

#+begin_src racket
;; 0-CFA result for a module
(struct cfa-result
  (flow-sets)  ;; hasheq: expr-id → (setof defn-name)
  #:transparent)

;; Key operations
(define (cfa-analyze module-env)
  ;; 1. Build constraint graph from all defn/defr definitions
  ;; 2. Compute fixpoint (iterate until flow sets stabilize)
  ;; 3. Return cfa-result
  ...)

(define (cfa-lookup result expr-id)
  ;; Returns the set of functions that could flow to expr-id
  (hash-ref (cfa-result-flow-sets result) expr-id (set)))

;; Integration with narrowing
(define (narrow-higher-order net f-cell arg-cells result-cell cfa)
  (define flow-set (cfa-lookup cfa (cell->expr-id f-cell)))
  (cond
    [(set-empty? flow-set)
     ;; No functions flow here — residuate
     net]
    [(= 1 (set-count flow-set))
     ;; Exactly one function — narrow through it directly
     (install-narrowing-propagators net (set-first flow-set) arg-cells result-cell)]
    [else
     ;; Multiple functions — create amb over the set
     (atms-amb net (set->list flow-set)
       (lambda (net fn-name)
         (install-narrowing-propagators net fn-name arg-cells result-cell)))]))
#+end_src

*** 2.1.5 Scope: Demand-Driven Analysis

0-CFA can be scoped at different granularities:

| Scope | Precision | Cost | When |
|-|-|-|-|
| Per-function | Low (only local calls) | O(n) per function | Phase 3a initial |
| Per-module | Medium (all calls in module) | O(n^2) per module | Phase 3a+ (optional) |
| Whole-program | High (all calls) | O(n^3) worst case | Phase 3a++ (optional) |

For Phase 3a, the analysis is /demand-driven/: 0-CFA runs only when the
elaborator encounters a higher-order argument in a narrowing context
(signaled by the presence of =?=-prefixed variables). This avoids
analyzing functions that are never narrowed through.

#+begin_example
Demand-driven 0-CFA trigger:
  1. Elaborator encounters [apply-op ?f 3N ?y] = 10N
  2. ?f is HO (function type) and ?-prefixed → narrowing context
  3. Check 0-CFA cache for apply-op's first argument → miss
  4. Run 0-CFA for apply-op, scoped to current module
  5. Cache result: f ∈ {add, mul, sub}
  6. Install narrowing propagators via amb over {add, mul, sub}
#+end_example

This is neither fully module-level (avoids analyzing unused functions)
nor fully lazy (the elaborator signals demand at the right granularity).
Results are cached per-module, so repeated narrowing through the same HO
argument pays the analysis cost only once. Cross-module flows are handled
conservatively: imported functions with unknown flow sets residuate.

*** 2.1.6 Implementation

| Component | File | Lines (est.) | Tests (est.) |
|-|-|-|-|
| 0-CFA constraint graph builder | =cfa-analysis.rkt= | 250 | 30 |
| 0-CFA fixpoint solver | =cfa-analysis.rkt= | 150 | 25 |
| Integration with narrowing | =narrowing.rkt= (modify) | 60 | 15 |
| *Sub-total Phase 3a* | *1 new + 1 modified* | *~460* | *~70* |

*** 2.1.7 Tests

- Simple call sites: =f = add= (direct assignment) → flow set = ={add}=
- Conditional: =let f = if b then add else mul= → flow set = ={add, mul}=
- Higher-order parameter: =defn apply [f x] := [f x]= with call
  =[apply add 3]= → =f= flows ={add}=
- Multiple call sites: same parameter receives different functions → union
- Narrowing with defunctionalized amb: =[apply-op ?f 3N 7N] = 10N= finds
  =f = add=
- Unknown function residuates (no 0-CFA info available)

** 2.2 Phase 3b: Configurable Search Heuristics

*** 2.2.1 Design: Three Orthogonal Axes

Following ECLiPSe's =search/6= design and Gecode's clean
propagate/branch separation, we extend the =solver= configuration with
three axes:

#+begin_src prologos
solver my-solver
  :variable-order  first-fail     ;; which variable to branch on
  :value-order     bisect         ;; which value/split to try
  :search          complete       ;; how to traverse the search tree
  :tabling         by-default
  :timeout         30
#+end_src

*** 2.2.2 Variable Ordering Strategies

Determines which unresolved variable to branch on next after propagation
reaches quiescence:

| Strategy | Implementation | Cost |
|-|-|-|
| =input-order= | First unresolved variable in declaration order | O(n) |
| =first-fail= | Variable with smallest domain | O(n) scan |
| =most-constrained= | Smallest domain, tiebreak by propagator count | O(n) scan |
| =max-weighted-degree= | Highest failure-weighted constraint degree | O(n) scan |
| =random= | Random unresolved variable | O(1) |

In the propagator/ATMS architecture:

#+begin_src racket
;; Variable ordering is a function: (net, unresolved-cells) → cell-id
(define (first-fail-select net cells)
  (argmin (lambda (cid) (domain-size (net-cell-read net cid))) cells))

(define (most-constrained-select net cells)
  (argmin (lambda (cid)
            (let ([dom (domain-size (net-cell-read net cid))]
                  [deg (length (cell-dependents net cid))])
              (cons dom (- deg))))  ;; tiebreak by degree (higher = preferred)
          cells))

;; Adaptive: max-weighted-degree (dom/wdeg, Boussemart et al. 2004)
;; Requires maintaining a weight counter per propagator, incremented on
;; domain wipeout (contradiction). Higher weight → more failure-prone.
(define (max-weighted-degree-select net cells weight-table)
  (argmin (lambda (cid)
            (let ([dom (domain-size (net-cell-read net cid))]
                  [wdeg (sum-weighted-degree cid weight-table)])
              (/ dom (max 1 wdeg))))
          cells))
#+end_src

*** 2.2.3 Value Ordering Strategies

Determines which value to try for the selected variable:

| Strategy | Implementation | Split |
|-|-|-|
| =indomain-min= | Try minimum value first | Enumerate: lo, lo+1, ... |
| =indomain-max= | Try maximum value first | Enumerate: hi, hi-1, ... |
| =bisect= | Binary domain split | [lo,mid] vs [mid+1,hi] |
| =random= | Random value from domain | Random element |

In the propagator/ATMS architecture:

#+begin_src racket
;; Value ordering creates the amb alternatives
(define (bisect-value net cid)
  (define dom (net-cell-read net cid))
  (define mid (quotient (+ (interval-lo dom) (interval-hi dom)) 2))
  ;; Returns two alternative domain restrictions
  (list (interval (interval-lo dom) mid)
        (interval (+ mid 1) (interval-hi dom))))

(define (indomain-min-value net cid)
  (define dom (net-cell-read net cid))
  ;; Returns: try lo first, then [lo+1, hi]
  (list (interval (interval-lo dom) (interval-lo dom))
        (interval (+ (interval-lo dom) 1) (interval-hi dom))))
#+end_src

*** 2.2.4 Search Strategies

Determines how the search tree is traversed:

| Strategy | Description | ATMS Mapping |
|-|-|-|
| =complete= | Exhaustive DFS | Default =atms-solve-all= |
| =(lds N)= | Limited discrepancy search (max N deviations) | Prioritize consistent worldviews with fewer non-first-choice assumptions |
| =(bb-min expr)= | Branch-and-bound minimization | Cost-bound cell as propagator |
| =(restart (luby K))= | Luby restart sequence | Reset assumptions after K conflicts |
| =(restart (geometric K G))= | Geometric restart | Reset after K*G^i conflicts |

