docs/tracking/2026-03-07_NARROWING_ABSTRACT_INTERPRETATION_DESIGN.org
*** 2.2.5 Search Strategy Integration

The search strategy modifies the /outer solve loop/ (Phase 1d's
=narrowing-solve=):

#+begin_src racket
;; Complete search (default)
(define (search-complete net goals)
  (atms-solve-all net goals))

;; Limited discrepancy search
(define (search-lds net goals max-discrepancy)
  ;; Filter worldviews by discrepancy count
  ;; Discrepancy = number of non-first-choice assumptions
  (define all (atms-solve-all net goals))
  (filter (lambda (wv) (<= (discrepancy-count wv) max-discrepancy)) all))

;; Branch-and-bound minimization
(define (search-bb-min net goals cost-expr)
  (define cost-cell (net-new-cell net +inf.0 min-merge))
  ;; Install propagator: when cost-cell improves, prune branches
  ;; where cost lower bound > current best
  ...)

;; Restart-based search
(define (search-restart net goals cutoff-fn)
  (let loop ([attempt 0] [best #f] [nogoods '()])
    (define cutoff (cutoff-fn attempt))
    ;; Add accumulated nogoods
    ;; Search until cutoff conflicts
    ;; Record new nogoods
    ;; Restart with fresh assumptions
    ...))
#+end_src

*** 2.2.6 Implementation

| Component | File | Lines (est.) | Tests (est.) |
|-|-|-|-|
| Variable ordering strategies | =search-heuristics.rkt= | 120 | 25 |
| Value ordering strategies | =search-heuristics.rkt= | 80 | 20 |
| Search strategies (LDS, BB, restart) | =search-strategies.rkt= | 250 | 35 |
| Extended =solver= config parsing | =solver.rkt= (modify) | 80 | 15 |
| Integration with narrowing solve loop | =narrowing.rkt= (modify) | 60 | 10 |
| *Sub-total Phase 3b* | *2 new + 2 modified* | *~590* | *~105* |

*** 2.2.7 Tests

- Variable ordering: first-fail selects tightest domain
- Variable ordering: most-constrained tiebreaks correctly
- Value ordering: bisect splits evenly
- Value ordering: indomain-min enumerates in order
- Search: complete finds all solutions
- Search: LDS finds solutions reachable within discrepancy bound
- Search: BB-min finds optimal solution
- Search: restart with Luby sequence finds solution
- Solver config: parsing new axes from =solver= form
- Integration: same problem with different heuristics → same solutions,
  different ordering/performance

** 2.3 Phase 3c: Global Constraints and Optimization

*** 2.3.1 Global Constraint Propagators

Global constraints are specialized propagators that achieve stronger
consistency than decomposition into binary constraints. Each is a
/propagator factory/: given constraint parameters, it creates propagators
with the appropriate cell dependencies and narrowing behavior.

#+begin_src prologos
;; Surface syntax for global constraints
all-different [x y z w]     ;; all variables must have distinct values
cumulative tasks 5           ;; task scheduling with capacity 5
element i xs v               ;; v = xs[i] (array element constraint)
#+end_src

*** 2.3.2 =all-different= Implementation

The =all-different= constraint uses /bound consistency/ (Puget 1998):

#+begin_src racket
;; all-different propagator: when a variable is assigned value v,
;; remove v from all other variables' domains
(define (all-different-propagator net cells)
  ;; For each cell:
  ;;   If singleton [v,v]: remove v from all other cells
  ;;   If domain size = count of remaining cells:
  ;;     Hall set detection → prune
  (for/fold ([net net])
            ([c cells])
    (define val (net-cell-read net c))
    (if (interval-singleton? val)
        (let ([v (interval-lo val)])
          (for/fold ([net net])
                    ([other (remove c cells)])
            (net-cell-write net other
              (interval-remove (net-cell-read net other) v))))
        net)))
#+end_src

For stronger consistency (matching-based filtering, Regin 1994), a more
sophisticated implementation using value graphs and maximum matching is
needed. This can be deferred to Phase 3c+ if bound consistency suffices
for initial use cases.

*** 2.3.3 Branch-and-Bound Optimization

Optimization problems use branch-and-bound: maintain a best-known solution
and prune branches that can't improve on it.

#+begin_src prologos
;; Surface syntax
solver opt-solver
  :search (bb-min cost)

solve [find ?x ?y]
  [add ?x ?y] = 100N
  [mul ?x ?y] = ?cost
  :minimize ?cost
#+end_src

**** ATMS Interaction: Global Cost Bound

The cost bound is /global/ across all ATMS worldviews, consistent with
the ATMS's global nogood semantics (D9 in Phase 1 design: nogoods are
shared, unconditional facts are shared). When a solution with cost $c$
is found in any worldview, /all/ worldviews are immediately pruned to
cost $< c$.

This is strictly more efficient than per-worldview bounds: a solution in
worldview $W_1$ prunes the search space of worldview $W_2$ without $W_2$
having to independently discover that bound.

Implementation: the cost-bound cell lives outside any specific worldview
(it is part of the search state, not the propagator network state). The
=atms-solve-all= loop updates it on each solution found.

#+begin_src racket
;; Branch-and-bound with global cost bound
(define (search-bb-min net goals cost-cell)
  ;; Global bound: shared across all worldviews
  (define global-bound (box +inf.0))
  (atms-solve-all net goals
    ;; Prune worldviews whose cost lower bound exceeds global best
    #:prune-fn (lambda (wv)
                 (define cost-lo (interval-lo (worldview-cell-read wv cost-cell)))
                 (< cost-lo (unbox global-bound)))
    ;; On each solution found: update the global bound
    #:on-solution (lambda (wv)
                    (define cost (interval-lo (worldview-cell-read wv cost-cell)))
                    (when (< cost (unbox global-bound))
                      (set-box! global-bound cost)))))

;; Additionally, install a pruning propagator within each worldview:
(define (install-bb-pruning-propagator net cost-cell global-bound)
  (net-add-propagator net (list cost-cell) (list cost-cell)
    (lambda (net)
      (define cost (net-cell-read net cost-cell))
      (define bound (unbox global-bound))
      (if (> (interval-lo cost) bound)
          ;; Prune: this branch can't improve on current best
          (struct-copy prop-network net [contradiction #t])
          ;; Tighten cost domain
          (net-cell-write net cost-cell
            (interval (interval-lo cost) (min (interval-hi cost) bound)))))))
#+end_src

*** 2.3.4 Implementation

| Component | File | Lines (est.) | Tests (est.) |
|-|-|-|-|
| =all-different= (bound consistency) | =global-constraints.rkt= | 120 | 25 |
| =cumulative= (timetable filtering) | =global-constraints.rkt= | 150 | 20 |
| =element= (array element) | =global-constraints.rkt= | 60 | 15 |
| Branch-and-bound optimization | =search-strategies.rkt= (extend) | 100 | 20 |
| Surface syntax for constraints | parser, elaborator (modify) | 80 | 15 |
| *Sub-total Phase 3c* | *1 new + 3 modified* | *~510* | *~95* |

*** 2.3.5 Tests

- =all-different=: singleton propagation removes value from peers
- =all-different=: Hall set detection (3 vars, 3 values → all determined)
- =all-different=: contradiction when domain too small for constraint
- =cumulative=: task scheduling with capacity bound
- =element=: index determines value, value constrains index
- BB-min: finds optimal solution for simple optimization
- BB-min: prunes suboptimal branches (count backtracks, verify reduction)
- Integration with narrowing: =[add ?x ?y] = 10N= with =all-different [?x ?y]=

