docs/tracking/2026-03-07_NARROWING_ABSTRACT_INTERPRETATION_DESIGN.org
** 2.4 Phase 3 Summary

| Sub-phase | Module | Lines (est.) | Tests (est.) |
|-|-|-|-|
| 3a: 0-CFA Auto-Defunctionalization | =cfa-analysis.rkt= | 460 | 70 |
| 3b: Configurable Search Heuristics | =search-heuristics.rkt=, =search-strategies.rkt= | 590 | 105 |
| 3c: Global Constraints + Optimization | =global-constraints.rkt= | 510 | 95 |
| *Phase 3 Total* | *4 new + 3 modified* | *~1,560* | *~270* |

** 2.5 Phase 3 Dependencies and Ordering

#+begin_example
Phase 1 (complete)
  |
  +-- Phase 3a (0-CFA)
  |     Depends on: narrowing propagator (Phase 1c)
  |     Independent of: Phases 2a-2c, 3b, 3c
  |
  +-- Phase 3b (Search Heuristics)
  |     Depends on: solver integration (Phase 1d)
  |     Independent of: Phases 2a-2c, 3a, 3c
  |     (Enhanced by Phase 2a: interval domains enable bisect strategy)
  |
  +-- Phase 3c (Global Constraints)
        Depends on: interval domain (Phase 2a) for numeric constraints
        Enhanced by: search heuristics (Phase 3b) for optimization
#+end_example

Recommended ordering: 3b → 3a → 3c (search heuristics are highest
impact and most independent; 0-CFA is moderately complex; global
constraints benefit from both interval domains and search heuristics).

* 3. Unified Roadmap: Phases 1--3

** 3.1 Complete Implementation Table

| Phase | Sub-phase | Description | Lines | Tests | New Files | Modified Files |
|-|-|-|-|-|-|-|
| 1 | 1a | Definitional Trees | 200 | 40 | =definitional-tree.rkt= | |
| 1 | 1b | Term Lattice | 150 | 30 | =term-lattice.rkt= | |
| 1 | 1c | Narrowing Propagator | 300 | 50 | =narrowing.rkt= | |
| 1 | 1d | Solver Integration | 200 | 50 | | =relations.rkt=, =solver.rkt= |
| 1 | 1e | WS-Mode Syntax | 100 | 30 | | parser, WS reader |
| 2 | 2a | Interval Abstract Domain | 530 | 105 | =interval-domain.rkt=, =narrowing-abstract.rkt= | =narrowing.rkt= |
| 2 | 2b | Termination Analysis | 390 | 80 | =termination-analysis.rkt= | =narrowing.rkt= |
| 2 | 2c | Confluence Analysis | 350 | 65 | =confluence-analysis.rkt= | =narrowing.rkt= |
| 3 | 3a | 0-CFA Auto-Defunctionalization | 460 | 70 | =cfa-analysis.rkt= | =narrowing.rkt= |
| 3 | 3b | Search Heuristics | 590 | 105 | =search-heuristics.rkt=, =search-strategies.rkt= | =solver.rkt=, =narrowing.rkt= |
| 3 | 3c | Global Constraints + Optimization | 510 | 95 | =global-constraints.rkt= | =search-strategies.rkt=, parser, elaborator |
| | | *Grand Total* | *~3,780* | *~720* | *11 new* | *~6 modified* |

** 3.2 Dependency Graph

#+begin_example
                    Phase 1
          (Core FL Narrowing, ~950 lines)
         /          |           \
        /           |            \
   Phase 2a      Phase 2b      Phase 2c
  (Interval)   (Termination)  (Confluence)
   ~530 lines   ~390 lines     ~350 lines
       |            |              |
       +-----+------+------+------+
             |             |
          Phase 3a      Phase 3b
          (0-CFA)      (Heuristics)
          ~460 lines   ~590 lines
             |             |
             +------+------+
                    |
                Phase 3c
          (Global Constraints)
              ~510 lines
#+end_example

** 3.3 Recommended Implementation Sequence

1. *Phase 1* (1a → 1b → 1c → 1d → 1e): Core narrowing. ~950 lines, ~200 tests.
   Duration estimate: major implementation phase.

2. *Phase 2b* (Termination Analysis): Static analysis, independent of other
   Phase 2 work. ~390 lines, ~80 tests. High value: prevents infinite loops.

3. *Phase 2a* (Interval Abstract Domain): Enables numeric narrowing. ~530
   lines, ~105 tests. High value: handles Nat/Int/PosInt.

4. *Phase 3b* (Search Heuristics): User-configurable search. ~590 lines,
   ~105 tests. High value: performance improvement.

5. *Phase 2c* (Confluence Analysis): Static analysis for soundness. ~350
   lines, ~65 tests. Important for correctness of non-deterministic functions.

6. *Phase 3a* (0-CFA): Auto-defunctionalization. ~460 lines, ~70 tests.
   Enables higher-order narrowing without manual defunctionalization.

7. *Phase 3c* (Global Constraints + Optimization): Advanced constraint
   solving. ~510 lines, ~95 tests. Enables practical optimization problems.

Rationale: Phase 1 is prerequisite for everything. Then 2b (termination)
gives safety, 2a (intervals) gives expressiveness, 3b (heuristics) gives
performance, 2c (confluence) gives correctness guarantees, 3a (0-CFA)
gives HO support, and 3c (global constraints) gives full constraint
programming capability.

* 4. Surface Syntax for Extended Features

** 4.1 Solver Configuration

#+begin_src prologos
;; Full solver configuration with all axes
solver constraint-solver
  :variable-order  first-fail
  :value-order     bisect
  :search          (bb-min cost)
  :tabling         by-default
  :timeout         60

;; Using a solver for narrowing
let solutions = with-solver constraint-solver
  [add ?x ?y] = 100N
  all-different [?x ?y]
#+end_src

** 4.2 Constraint Syntax

#+begin_src prologos
;; Interval domain constraints (implicit from types)
spec add : <(x : PosInt) -> (y : PosInt) -> PosInt>
;; PosInt → interval [1, +inf)

;; Global constraints
all-different [?x ?y ?z]       ;; distinct values
element ?i ?xs ?v              ;; array element
;; cumulative tasks cap         ;; resource scheduling (future)

;; Optimization
solve :minimize [cost ?x ?y]
  [profit ?x] = ?px
  [profit ?y] = ?py
  let ?total = [add ?px ?py]
#+end_src

** 4.3 Static Analysis Feedback

#+begin_src prologos
;; Termination analysis feedback (compiler messages)
;; INFO: add is terminating (size decrease on arg 1)
;; INFO: fib is terminating (size decrease on arg 1, both calls)
;; WARN: collatz is bounded-narrowable (fuel limit: 1000)
;; ERROR: loop is non-narrowable (no decreasing argument)

;; Confluence analysis feedback
;; INFO: add is confluent (inductively sequential)
;; WARN: insert has overlapping rules — using basic narrowing
;;       Consider making clauses non-overlapping for optimal narrowing
#+end_src

* 5. Interaction Between Phases

** 5.1 Interval Domains + Search Heuristics (2a + 3b)

Interval domains enable the =bisect= value ordering strategy:

#+begin_example
Variable ?x with domain [1, 100]:
  bisect → amb([1, 50], [51, 100])

  After propagation with [1, 50]:
    Further narrowing may determine ?x = [23, 23]

  With first-fail variable ordering:
    Select the variable with smallest domain → most constrained → fewest
    backtracks needed
#+end_example

** 5.2 Termination Analysis + Interval Domains (2b + 2a)

Termination analysis can use interval domain sizes for fuel estimation:

#+begin_example
Function f : PosInt -> PosInt -> Nat
  Size decrease on arg 1
  With interval domain [1, K] for arg 1:
    Max recursion depth = K
    Fuel bound = K (not infinite)
#+end_example

When the interval domain is finite, the termination analysis can compute
a precise fuel bound instead of using a fixed default.

