docs/tracking/2026-03-07_NARROWING_ABSTRACT_INTERPRETATION_DESIGN.md


<a id="org8afec32"></a>

## 5.3 0-CFA + Narrowing Propagator (3a + 1c)

0-CFA results feed directly into the narrowing propagator's handling of higher-order arguments:

```
narrowing-propagator at Branch node, argument is HO function:
  1. Check: is the cell a known function? → narrow directly
  2. Check: does 0-CFA give a finite flow set? → amb over set
  3. Otherwise: residuate
```


<a id="orgc813c91"></a>

## 5.4 Confluence + Termination (2c + 2b)

A non-confluent function that is also non-terminating is particularly dangerous: narrowing may loop AND produce inconsistent results. The combination of both analyses gives a clear classification:

| Confluent | Terminating | Classification                              |
|--------- |----------- |------------------------------------------- |
| Yes       | Yes         | Safe for unrestricted narrowing             |
| Yes       | No          | Use fuel bounds                             |
| No        | Yes         | Use basic narrowing (sound but not optimal) |
| No        | No          | Non-narrowable (residuate only)             |


<a id="orgbaff0f7"></a>

## 5.5 Global Constraints + Narrowing (3c + 1c)

Global constraints and narrowing propagators coexist in the same propagator network and run to quiescence together:

```
solve
  [add ?x ?y] = 10N       ;; narrowing propagator
  all-different [?x ?y]   ;; global constraint propagator

  1. Narrowing: ?x ∈ [0,10], ?y ∈ [0,10]
  2. all-different: if ?x = 5, then ?y ≠ 5
  3. Combined: 10 solutions instead of 11 (5+5 excluded)
```


<a id="orgea79cf7"></a>

## 5.6 Narrowing and Effects (Pure Fragment Only)

Narrowing operates exclusively over the *pure fragment* of Prologos. Functions with capability requirements (QTT resource usage, IO effects, session types) are automatically non-narrowable.

The QTT system makes this distinction explicit at the type level:

-   **Pure functions** (`spec f : A -> B` with no capability binders): the function body can be symbolically executed via narrowing. These are narrowable.

-   **Capability-bearing functions** (`spec f {Cap} : A -> B`): the erased capability binder indicates the function body may perform effects. Even though `Cap` is erased at runtime, the function *semantically* depends on external state. Narrowing would require symbolically executing the effect, which is nonsensical. These are non-narrowable; the narrowing propagator residuates.

-   **Session-typed processes** (`proc` definitions): narrowing does not apply to processes — they are communicating entities, not term-rewriting functions. No interaction needed.

This classification requires no additional analysis: the elaborator already knows whether a function has capability binders from its type. A function's `narrowing-info` simply inherits `non-narrowable` when capability binders are present, before termination or confluence analysis even runs.

```
spec read-config {ReadCap} : <(path : String) -> Config>
;; narrowing-info: non-narrowable (capability-bearing)
;; [read-config ?path] = some-config  →  residuates (waits for ?path to be bound)

spec add : <(x : Nat) -> (y : Nat) -> Nat>
;; narrowing-info: terminating, confluent (pure)
;; [add ?x ?y] = 13N  →  narrows to 14 solutions
```


<a id="orge773441"></a>

# 6. Open Research Questions


<a id="orge6157e0"></a>

## 6.1 Phase 2 Open Questions

1.  **Length-interval domain for structured types** (Phase 2a+): For `List`, `String`, and other recursive types, a *length-interval* Galois connection abstracts the structure to its size: `alpha(Cons(_, Cons(_, Nil))) = [2, 2]`, `gamma([2, 4]) = "at least 2 and at most 4 elements"`. This enables propagation like `length(?xs) + length(?ys) = length(zs)` for `append` queries. Note that for finite constructor ADTs (`List` has 2 constructors: `Nil`, `Cons`), Phase 1's needed narrowing handles the common case directly &#x2014; the length domain adds value primarily when propagating size constraints across multiple list variables to prune the search space without enumerating. For `Vec n A` (dependently typed), the type index `n` *is* the size &#x2014; the type system provides the abstraction for free.

2.  **Widening precision**: Standard interval widening loses significant precision. *Widening with thresholds* (set of landmark values that the widened interval preserves) may recover precision. Implementation cost is minimal (extend the widen function with a threshold set).

3.  **Size-change termination vs. dependency pairs**: The LJBA criterion handles most practical functions but not all terminating ones. *Dependency pairs* (Arts & Giesl 2000) are strictly more powerful but more complex to implement. Defer to Phase 2b+ if needed.

4.  **Confluence checking decidability**: Joinability is undecidable for general TRS. Our scope is limited to inductively sequential functions with finite constructor sets, where decidability is not an issue. For non-IS functions, we conservatively classify as `unknown`.


<a id="org680527c"></a>

## 6.2 Phase 3 Open Questions

1.  **0-CFA precision**: 0-CFA may be imprecise for polymorphic higher-order functions (merges flow sets across all call sites). *1-CFA* (call-site sensitive) improves precision at higher cost. Start with 0-CFA; upgrade to k-CFA if precision is insufficient in practice.

2.  **Adaptive heuristics state**: `max-weighted-degree` requires maintaining weight counters across search. In a persistent/immutable propagator network, this means threading weight state through the search. The ATMS's persistent nature makes this natural (weights are part of the ATMS state).

3.  **Global constraint strength**: Bound consistency for `all-different` is weaker than matching-based GAC (Regin 1994). For most Prologos use cases, bound consistency suffices. GAC implementation can be deferred.

4.  **Branch-and-bound with restarts**: Combining optimization with restart search requires careful handling of incumbent solutions across restarts. The ATMS's persistent nature helps (the best-known solution is a cell value that persists across restarts).


<a id="org2d71d78"></a>

# 7. Connection to Existing Research Documents

This design document is part of a coherent research arc:

1.  **Effectful Propagators** (`2026-03-06_EFFECTFUL_PROPAGATORS.org`): Established propagator networks as the computational substrate.

2.  **Session Types as Effect Ordering** (`2026-03-06_SESSION_EFFECT_ORDERING.org`): Showed session types as causal ordering over effects on the propagator substrate.

3.  **Propagators as Model Checkers** (`2026-03-07_PROPAGATORS_AS_MODEL_CHECKERS.org`): Showed the structural isomorphism between propagator fixpoints and CTL model checking. Narrowing-based symbolic reachability (§5.4 of the Search Heuristics research doc) is the narrowing side of this isomorphism.

4.  **Narrowing and Search Heuristics** (`2026-03-07_NARROWING_AND_SEARCH_HEURISTICS.org`): General research survey of the three converging lines. This document and the Phase 0&#x2013;1 design document are the implementation-oriented refinements.

5.  **FL Narrowing Phase 0&#x2013;1 Design** (`2026-03-07_FL_NARROWING_DESIGN.org`): Core narrowing machinery. This document (Phase 2&#x2013;3) is its direct companion.

The arc: propagators → effects → ordering → model checking → narrowing → abstract interpretation → search → constraints → optimization. Each builds on the previous, all unified on the propagator substrate.


<a id="orga73c4ef"></a>

# 8. Design Decisions


<a id="orgef034c7"></a>

## DD-1: Interval Domain as First Abstract Domain

Start with intervals for numeric types. This covers the most common infinite constructor universe (`Nat`, `Int`, `PosInt`). Other abstract domains (set domain for `List` length, string length domain) can be added incrementally using the same Galois connection infrastructure.
